<a href="https://colab.research.google.com/github/institutohumai/cursos-python/blob/master/AnalisisDeDatos/1_Indexing/Indexing.ipynb"> <img src='https://colab.research.google.com/assets/colab-badge.svg' /> </a>
<div align="center"> Recordá abrir en una nueva pestaña </div>

In [1]:
# Siempre al principio, importamos las librerías.
import pandas as pd
import numpy as np

# Tabla de Contenidos

    I. Análisis de datos con Pandas
    II. Los objetos fundamentales de Pandas
        I. Series
        II. DataFrames
        III. Índices
    III. Exploración
        I. Filtrando un DataFrame (Indexing)
            I. Boolean Indexing
                I. Máscara booleana
                II. Máscara booleana con muchas condiciones
            II. Boolean indexing con query()
            III. Fancy Indexing
        II. Funciones de Agregación
    IV. Otros análisis descriptivos
        I. Para las variables numéricas
        II. Para las variables categóricas
        III. Ordenar por columnas y limitar la cantidad de resultados
    V. Anexo: volviendo al tema de la vectorización

# Exploración

Vamos a analizar datos de una fuente real. Los ingresos de los funcionarios son información pública que se libera anualmente en el <a href='https://data.buenosaires.gob.ar/dataset/sueldo-funcionarios'>portal de datos abiertos</a> de GCBA.  

En general los 4 primeros pasos para analizar un data set son:
1. Leerlo
2. Consultar cuáles son las columnas
3. Extraer una muestra
4. Verificar cuántos registros tiene

## 1- Para leer el data set usamos la función de pandas read_csv

Con esta función podemos leer archivos que estén en una url pública o en una ubicación del disco accesible desde la Jupyter Notebook.

In [2]:
df = pd.read_csv('http://cdn.buenosaires.gob.ar/datosabiertos/datasets/sueldo-funcionarios/sueldo_funcionarios_2019.csv')

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
pd.read_csv?

## 2- Consultamos las columnas

In [5]:
df.columns

Index(['cuil', 'anio', 'mes', 'funcionario_apellido', 'funcionario_nombre',
       'reparticion', 'asignacion_por_cargo_i', 'aguinaldo_ii',
       'total_salario_bruto_i_+_ii', 'observaciones'],
      dtype='object')

## 3- Extraemos una muestra

In [6]:
df.sample(5)

,cuil,anio,mes,funcionario_apellido,funcionario_nombre,reparticion,asignacion_por_cargo_i,aguinaldo_ii,total_salario_bruto_i_+_ii,observaciones
295,27-17593512-1,2019,10,MONTIEL,MARIA LETICIA,SECR Legal y Técnica,267913.50,0.00,267913.50,NaN
369,20-24941711-5,2019,12,MURA,MARTIN,Ministerio de Hacienda y Finanzas,275089.75,137544.87,412634.62,NaN
169,27-24030362-6,2019,6,TAGLIAFERRI,GUADALUPE,Ministerio de Hábitat y Desarrollo Humano,249661.60,124830.80,374492.40,NaN
115,20-22293622-6,2019,4,FERNANDEZ,DIEGO HERNAN,SECR Integración Social y Urbana,226866.41,0.00,226866.41,NaN
110,20-16891528-5,2019,4,NACHON,MARCELO JORGE,SECR de Medios,243148.69,0.00,243148.69,NaN

## 4- Consultamos la cantidad de filas y de columnas

In [7]:
# La propiedad shape nos devuelve una tupla (filas,columnas)
df.shape

(385, 10)

# Vectorización con Pandas

Pandas es una de las librerías de Python más usadas para análisis de datos. El nombre pandas viene de "Panel Data Analysis" y su funcionalidad permite hacer operaciones sobre datos que se encuentran en memoria de manera eficiente. 

Pandas es útil para trabajar sobre datos tabulares, con dos condiciones importantes:

I. Los datos se encuentran enteramente en la memoria RAM. Con lo cual, el tamaño de los datos que podemos manipular está limitado por el hardware. Como regla de pulgar, es una buena práctica no ocupar más de 1/3 de la memoria RAM de nuestro dispositivo con el dataset. Así, si estamos trabajando localmente en una notebook con 8GB de memoria RAM no es recomendable procesar datasets de más de 2.33GB.

II. En pandas, las operaciones sobre filas y columnas son, en general, eficientes porque se hacen de forma "vectorizada". En realidad esta optimización, se hace desde numpy, una librería para realizar operaciones matemáticas que se utilizó a su vez para escribir pandas. 

Las operaciones vectorizadas son las que se realizan en bloque en vez de caso por caso. Las computadoras de hoy tienen la capacidad de recibir muchas instrucciones juntas y procesar varias de ellas a la vez. Por ejemplo, si nuestro hardware tiene la capacidad de procesar 4 operaciones juntas, el resultado de vectorizar una operación matemática es el siguiente:

<img src = 'https://datasets-humai.s3.amazonaws.com/images/vectorizacion.png' /> 


En el primer caso hay que hacer 5 operaciones y en el segundo caso sólo dos.

Es importante entender, entonces, que Pandas trabaja de esta manera y que por eso es una de las herramientas más elegidas para manipular datos en memoria.



# Los objetos fundamentales de Pandas

## Series

Las series son "columnas" que de una tabla que están asociadas a un índice y a un nombre. Igual que una lista común de Python es una secuencia de elementos ordenados, pero a diferencia de la lista está asociada a más información.

In [8]:
# Las series se pueden crear a partir de una lista
serie = pd.Series(['a','b','c'])

In [9]:
# Propiedades importantes de las series
print('Tipo de objetos que tiene ', serie.dtype)
print('Nombre ', serie.name)
print('Index ',serie.index)
print('Valores ',serie.values)

Tipo de objetos que tiene  object
Nombre  None
Index  RangeIndex(start=0, stop=3, step=1)
Valores  ['a' 'b' 'c']

## DataFrames

Los DataFrames son "tablas", compuestas por varias "columnas" o series que comparten todas un mismo índice. En general los DataFrames se crean a partir de leer tablas de archivos (pueden ser en formato json o csv) pero a veces también se crean a partir de listas de diccionarios o de otras maneras. 

Los DataFrames tienen un objeto Index que describe los nombres de columnas y otro objeto Index que describen los nombres de las filas.

In [ ]:
# Leemos un dataset público
df = pd.read_csv('http://cdn.buenosaires.gob.ar/datosabiertos/datasets/sueldo-funcionarios/sueldo_funcionarios_2019.csv')

In [10]:
# Propiedades importantes de los dataframes
print('Columnas ', df.columns)
print('Index ', df.index)
print('Dimensiones ',df.shape)

Columnas  Index(['cuil', 'anio', 'mes', 'funcionario_apellido', 'funcionario_nombre',
       'reparticion', 'asignacion_por_cargo_i', 'aguinaldo_ii',
       'total_salario_bruto_i_+_ii', 'observaciones'],
      dtype='object')
Index  RangeIndex(start=0, stop=385, step=1)
Dimensiones  (385, 10)

In [11]:
# Consultar las primeras filas
df.head()

,cuil,anio,mes,funcionario_apellido,funcionario_nombre,reparticion,asignacion_por_cargo_i,aguinaldo_ii,total_salario_bruto_i_+_ii,observaciones
0,20-17692128-6,2019,1,RODRIGUEZ LARRETA,HORACIO ANTONIO,Jefe de Gobierno,197745.80,0.0,197745.80,NaN
1,20-17735449-0,2019,1,SANTILLI,DIEGO CESAR,Vicejefatura de Gobierno,197745.80,0.0,197745.80,NaN
2,27-24483014-0,2019,1,ACUÑA,MARIA SOLEDAD,Ministerio de Educación e Innovación,224516.62,0.0,224516.62,NaN
3,20-13872301-2,2019,1,ASTARLOA,GABRIEL MARIA,Procuración General de la Ciudad de Buenos Aires,224516.62,0.0,224516.62,NaN
4,20-25641207-2,2019,1,AVOGADRO,ENRIQUE LUIS,Ministerio de Cultura,224516.62,0.0,224516.62,NaN

Si queremos extraer una serie del DataFrame, podemos hacerlo de la misma forma en que extraemos un valor de un diccionario.

In [12]:
serie_mes = df['mes']

In [13]:
type(serie_mes)

pandas.core.series.Series

In [14]:
serie_mes.name

'mes'

In [19]:
serie_mes.unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12], dtype=int64)

## Índices

Los índices acompañan a las series y a los Data Frames. Son conjuntos ordenados e inmutables de elementos

In [20]:
df.index

RangeIndex(start=0, stop=385, step=1)

In [21]:
df.columns

Index(['cuil', 'anio', 'mes', 'funcionario_apellido', 'funcionario_nombre',
       'reparticion', 'asignacion_por_cargo_i', 'aguinaldo_ii',
       'total_salario_bruto_i_+_ii', 'observaciones'],
      dtype='object')

In [22]:
ind = pd.Index([2, 3, 5, 7, 7, 11])
ind

Int64Index([2, 3, 5, 7, 7, 11], dtype='int64')

In [22]:
ind[1] = 0

TypeError: ignored

### Ejercicio
Exploren el dataset público que se encuentra en la siguiente url: https://datasets-humai.s3.amazonaws.com/datasets/titanic.csv ¿De qué se trata? ¿Cuántas filas tiene? ¿Cuántas columnas? Al leerlo, pueden almacenarlo en la variable df_titanic.

In [23]:
df_titanic = pd.read_csv('https://datasets-humai.s3.amazonaws.com/datasets/titanic.csv', sep='|')

In [24]:
df_titanic.shape

(891, 12)

In [25]:
df_titanic.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,2678,15.2458,NaN,C
629,630,0,3,"O'Connell, Mr. Patrick D",male,NaN,0,0,334912,7.7333,NaN,Q
253,254,0,3,"Lobb, Mr. William Arthur",male,30.0,1,0,A/5. 3336,16.1000,NaN,S
90,91,0,3,"Christmann, Mr. Emil",male,29.0,0,0,343276,8.0500,NaN,S
525,526,0,3,"Farrell, Mr. James",male,40.5,0,0,367232,7.7500,NaN,Q

In [26]:
df_titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
df_titanic.loc[[4,2],]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

## Filtrando un DataFrame (Indexing)

Hay muchas técnicas para filtrar un DataFrame. Podemos querer filtrar por columnas o por filas, por posición o por nombre. También podemos querer filtrar por condiciones que se cumplen o no. Cuando no queremos filtrar sobre una dimensión (filas o columnas) usamos ":" para seleccionar todo.


<img src='https://github.com/institutohumai/cursos-python/blob/master/AnalisisDeDatos/1_Indexing/img/indexing.png?raw=1' style='height:350px' />

### Boolean Indexing

Supongamos que queremos tomar el dataset de funcionarios y quedarnos únicamente con los que pertenecen al Ministerio de Cultura.
Para eso lo que hacemos es indexar al DataFrame por una condición booleana. Eso implica que debemos crear una serie compuesta por valores True y False para aplicarla como índice a las filas.

Los operadores que sirven para evaluar condiciones sobre las series son:


| S  | Descripción   | S  | Descripción   |   |
|----|---------------|----|---------------|---|
| >= | Mayor o Igual | <= | Menor o Igual |   |
| == | Igual         | != | Distinto      |   |
| >  | Mayor         | <  | Menor         |   |

#### Máscara booleana

Veamos lo que pasa cuando le aplicamos a una serie una condición que devuelve un booleano

In [41]:
df['anio'] != 2019

0      False
1      False
2      False
3      False
4      False
       ...
380    False
381    False
382    False
383    False
384    False
Name: anio, Length: 385, dtype: bool

In [42]:
mascara_booleana = df['anio'] != 2019

Nos devuelve una serie de la misma longitud que la original y que contiene sólo valores True o False.

In [43]:
type(mascara_booleana)

pandas.core.series.Series

In [44]:
mascara_booleana.shape

(385,)

In [38]:
mascara_booleana.dtype

dtype('bool')

Ahora seleccionemos entonces, los registros que corresponden al Ministerio de Cultura.

In [45]:
df_min_cul = df.loc[df['reparticion'] == 'Ministerio de Cultura',:]

In [46]:
# Veamos la cantidad de casos
df_min_cul.shape

(12, 10)

Algo que puede llegar a confundir sobre el Indexing en Pandas es que en algunos casos se puede ser menos explícito a la hora de filtrar. Por ejemplo si ponemos una condición Booleana, pandas asume que el tipo de indexing es loc y que el filtro es sobre las filas y no sobre las columnas:

In [47]:
df_min_cul = df[df['reparticion'] == 'Ministerio de Cultura']

In [48]:
df.sample(5)

,cuil,anio,mes,funcionario_apellido,funcionario_nombre,reparticion,asignacion_por_cargo_i,aguinaldo_ii,total_salario_bruto_i_+_ii,observaciones
349,20-16461252-0,2019,12,GONZALEZ BERNALDO DE QUIROS,FERNAN,Ministerio de Salud,192562.83,16046.9,208609.73,alta desde el 10/12
195,20-17110752-1,2019,7,MACCHIAVELLI,EDUARDO ALBERTO,Ministerio de Ambiente y Espacio Público,263531.98,0.0,263531.98,NaN
141,20-16891528-5,2019,5,NACHON,MARCELO JORGE,SECR de Medios,243148.69,0.0,243148.69,NaN
311,20-31164337-2,2019,10,DI BENEDETTO,FEDERICO,SS Comunicacion,249972.87,0.0,249972.87,NaN
14,27-17593512-1,2019,1,MONTIEL,MARIA LETICIA,SECR Legal y Técnica,218659.66,0.0,218659.66,NaN

In [49]:
df_min_cul.shape

(12, 10)

Probemos con otra condición.

### Ejercicio

Traer todos los sueldos de la segunda mitad del año...

In [50]:
df_sueldos =  df[df['mes'] >= 7]
df_sueldos.shape

(197, 10)

# Suma de sueldos por semestre

In [53]:
df[df['mes'] <=6]['asignacion_por_cargo_i'].sum()

42375391.45

In [54]:
df[df['mes'] > 6]['asignacion_por_cargo_i'].sum()

47804840.230000004

### Ejercicio
Volviendo al DataFrame del Titanic ¿Cuántos pasajeros sobrevivieron y cuántos no? ¿Cuántos pagaron una tarifa menor a 25?

In [48]:
df_titanic.sample(5)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
153          154         0       3  ...  14.50   NaN         S
450          451         0       2  ...  27.75   NaN         S
497          498         0       3  ...  15.10   NaN         S
829          830         1       1  ...  80.00   B28       NaN
678          679         0       3  ...  46.90   NaN         S

[5 rows x 12 columns]

In [55]:
df_titanic_surv = df_titanic[df_titanic['Survived']==1]

In [56]:
df_titanic_surv.shape

(342, 12)

In [57]:
df_titanic[df_titanic['Survived']==0].shape

(549, 12)

In [58]:
df_titanic[df_titanic['Fare']<25].shape

(557, 12)

#### Máscara booleana con muchas condiciones

Ahora tratemos de filtrar el dataset por dos condiciones: por ejemplo tomar los sueldos de abril de la secretaria de innovación. 
Para eso tenemos que combinar dos máscaras booleanas con una condición.

| S | Descripcion        | S  | Descripcion |   |
|---|--------------------|----|-------------|---|
| & | AND (y)            | \| | OR (o)      |   |
| ^ | XOR (o exclusivo)  | ~  | NOT (no)    |   |



Por ejemplo: seleccionemos los casos donde o bien se haya cobrado aguinaldo o bien el salario total haya sido mayor que 240.000, pero no las dos cosas.

In [59]:
df[(df['total_salario_bruto_i_+_ii'] > 240000) & (df['aguinaldo_ii'] > 0)].sample(5)

,cuil,anio,mes,funcionario_apellido,funcionario_nombre,reparticion,asignacion_por_cargo_i,aguinaldo_ii,total_salario_bruto_i_+_ii,observaciones
365,27-13092400-5,2019,12,FREDA,MONICA BEATRIZ,Sindicatura General de la Ciudad de Buenos Aires,275089.75,137544.87,412634.62,NaN
168,20-21981279-6,2019,6,SCRENCI SILVA,BRUNO GUIDO,Ministerio de Gobierno,249661.60,124830.80,374492.40,NaN
382,20-21981279-6,2019,12,SCRENCI SILVA,BRUNO GUIDO,Ministerio de Gobierno,275089.75,137544.87,412634.62,NaN
187,20-31164337-2,2019,6,DI BENEDETTO,FEDERICO,SS Comunicacion,226866.41,113433.21,340299.62,NaN
186,20-28908968-4,2019,6,COELHO CHICANO,CHRISTIAN,SS Contenidos,226866.41,113433.21,340299.62,NaN

Ahora veamos los sueldos de febrero de la SECR Ciencia, Tecnologia e Innovacion.

In [59]:
df[(df['mes'] == 2) & (df['reparticion'] == 'SECR Ciencia, Tecnologia e Innovacion')]

             cuil  anio  ...  total_salario_bruto_i_+_ii   observaciones
55  20-26781618-3  2019  ...                   238020.15  baja 28/2/2019

[1 rows x 10 columns]

### Boolean indexing con query()

La sintaxis que se utiliza para hacer Boolean indexing es un poco repetitiva. Noten que filtrar (aún en su expresión más corta sin loc ni especificar filas o columnas) implica ESCRIBIR DOS VECES el nombre del dataset. Para crear un shortcut, Pandas ofrece la función .query()

In [60]:
df_cult = df.query('reparticion == "Ministerio de Cultura"')

También se puede hacer query sobre múltiples condiciones.

In [61]:
df2 = df.query('asignacion_por_cargo_i > 240000 & aguinaldo_ii > 0')

In [62]:
df2.shape

(34, 10)

In [65]:
df2.columns

Index(['cuil', 'anio', 'mes', 'funcionario_apellido', 'funcionario_nombre',
       'reparticion', 'asignacion_por_cargo_i', 'aguinaldo_ii',
       'total_salario_bruto_i_ii', 'observaciones'],
      dtype='object')

In [64]:
df2.columns = ['cuil', 'anio', 'mes', 'funcionario_apellido', 'funcionario_nombre',
       'reparticion', 'asignacion_por_cargo_i', 'aguinaldo_ii',
       'total_salario_bruto_i_ii', 'observaciones']

### Ejercicio: Piensen cómo traducir a la sintaxis de query, estas consultas que ya hicimos:

In [66]:
df_sem2 = df.query('mes > 6')
df_sem2.sample(5)

,cuil,anio,mes,funcionario_apellido,funcionario_nombre,reparticion,asignacion_por_cargo_i,aguinaldo_ii,total_salario_bruto_i_+_ii,observaciones
301,20-22293622-6,2019,10,FERNANDEZ,DIEGO HERNAN,SECR Integración Social y Urbana,249972.87,0.00,249972.87,NaN
318,27-13092400-5,2019,11,FREDA,MONICA BEATRIZ,Sindicatura General de la Ciudad de Buenos Aires,275089.75,0.00,275089.75,NaN
373,20-22293873-3,2019,12,MIGUEL,FELIPE OSCAR,Jefatura de Gabinete de Ministros,275089.75,137544.87,412634.62,NaN
377,27-21759789-2,2019,12,LEGUIZAMON,ISABELLA KARINA,"Consejo de los Derechos de Niñas, Niños y Adol...",249972.86,124986.43,374959.29,NaN
380,20-26735689-1,2019,12,MENDEZ,JUAN JOSE,SECR Transporte y Obras Públicas,249972.86,124986.43,374959.29,NaN

In [67]:
# df[(df['mes'] == 2) & (df['reparticion'] == 'SECR Ciencia, Tecnologia e Innovacion')]
df_ciencia = df.query('mes ==2 & reparticion == "SECR Ciencia, Tecnologia e Innovacion"')
df_ciencia

,cuil,anio,mes,funcionario_apellido,funcionario_nombre,reparticion,asignacion_por_cargo_i,aguinaldo_ii,total_salario_bruto_i_+_ii,observaciones
55,20-26781618-3,2019,2,LARRE,PEDRO ANDRES,"SECR Ciencia, Tecnologia e Innovacion",204017.27,34002.88,238020.15,baja 28/2/2019

### Fancy Indexing

Ahora vamos a quedarnos con un subconjunto de columnas del DataFrame.

In [68]:
df_view = df.loc[:,['anio','mes']]

In [69]:
df_view.shape

(385, 2)

In [70]:
df_view.sample(5)

     anio  mes
61   2019    2
185  2019    6
3    2019    1
359  2019   12
362  2019   12

Existe una forma menos explícita de hacer esta misma operación. Si pasamos una lista al indexing, pandas asume que el tipo de indexing es loc y que el filtro es sobre las columnas y no las filas:

In [71]:
df_view = df[['anio','mes']]

In [72]:
df_view.shape

(385, 2)

Fíjense lo que pasa si tratamos de acceder a filas utilizando una lista de nombres, en este caso [0,1].

In [ ]:
# Incorrecto
df_view = df[[3,8]]

Nos da un error porque cuando pasamos únicamente una lista al indexing, pandas asume que queremos un set de columnas y si los nombres no existen, da error. La forma correcta de hacerlo es pasar una lista de índices y explicitar que vamos a indizar con loc y que seleccionamos todas las columnas.

In [73]:
# Correcto
df_view = df.loc[[3,8],:]

In [74]:
df_view

,cuil,anio,mes,funcionario_apellido,funcionario_nombre,reparticion,asignacion_por_cargo_i,aguinaldo_ii,total_salario_bruto_i_+_ii,observaciones
3,20-13872301-2,2019,1,ASTARLOA,GABRIEL MARIA,Procuración General de la Ciudad de Buenos Aires,224516.62,0.0,224516.62,NaN
8,20-22293873-3,2019,1,MIGUEL,FELIPE OSCAR,Jefatura de Gabinete de Ministros,224516.62,0.0,224516.62,NaN

### Ejercicio. Volviendo al ejemplo del titanic...

1) ¿Cuántos hombres y mujeres sobrevivieron? 

2) ¿Cuántos menores de 18 años había? ¿Cuántos sobrevivieron?

3) Seleccionen únicamente las columnas Sex y Survived y almacenenlas en un nuevo DataFrame que se llame df_titanic_subset.

In [89]:
df_titanic.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
572,573,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0,0,PC 17474,26.3875,E25,S
292,293,0,2,"Levy, Mr. Rene Jacques",male,36.0,0,0,SC/Paris 2163,12.8750,D,C
235,236,0,3,"Harknett, Miss. Alice Phoebe",female,NaN,0,0,W./C. 6609,7.5500,NaN,S
653,654,1,3,"O'Leary, Miss. Hanora ""Norah""",female,NaN,0,0,330919,7.8292,NaN,Q
757,758,0,2,"Bailey, Mr. Percy Andrew",male,18.0,0,0,29108,11.5000,NaN,S
780,781,1,3,"Ayoub, Miss. Banoura",female,13.0,0,0,2687,7.2292,NaN,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
431,432,1,3,"Thorneycroft, Mrs. Percival (Florence Kate White)",female,NaN,1,0,376564,16.1000,NaN,S
281,282,0,3,"Olsson, Mr. Nils Johan Goransson",male,28.0,0,0,347464,7.8542,NaN,S
837,838,0,3,"Sirota, Mr. Maurice",male,NaN,0,0,392092,8.0500,NaN,S

In [129]:
df_titanic[(df_titanic['Sex']=='male') & (df_titanic['Survived']==1)]['PassengerId'].count()

109

In [128]:
df_titanic[(df_titanic['Sex']=='female') & (df_titanic['Survived']==1)]['PassengerId'].count()

233

In [132]:
df_titanic['PassengerId'].count()

891

In [127]:
df_titanic[(df_titanic['Age']<18)]['PassengerId'].count()

113

In [131]:
df_titanic[(df_titanic['Age']>=18)]['PassengerId'].count()

601

In [123]:
df_titanic['Age'].isnull().sum()

177

In [130]:
df_titanic[(df_titanic['Age']<18) & (df_titanic['Survived']==1)]['PassengerId'].count()

61

In [110]:
df_titanic_subset = df_titanic[['Sex','Survived']]

In [111]:
df_titanic_subset.head()

      Sex  Survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0

## Funciones de Agregación

Utilizando Pandas podemos aplicar funciones a nivel de columna. Algunas funciones predefinidas son la media, el desvío estándar y la sumatoria, el valor máximo y el mínimo.

Algunas de las funciones de agregación más comunes son:

<ul>
    <li>min</li>
    <li>max</li>
    <li>count</li>
    <li>sum</li>
    <li>prod</li>
    <li>mean</li>
    <li>median</li>
    <li>mode</li>
    <li>std</li>
    <li>var</li>
</ul>

In [77]:
df['mes'].max()

12

In [78]:
df['asignacion_por_cargo_i'].mean()

234234.3679999999

In [79]:
df['asignacion_por_cargo_i'].std()

35043.16008466176

In [80]:
df['total_salario_bruto_i_+_ii'].sum()

97988834.36000001

Podemos combinar los filtros que vimos antes con las funciones de agregación para responder preguntas cómo ¿Cuál fue en gasto en asignaciones de funcionarios para la Secretaría de Medios 2019? ¿Y para la de Justicia y Seguridad?

In [81]:
df[df['reparticion'] == 'SECR de Medios']['total_salario_bruto_i_+_ii'].sum()

3232402.25

In [ ]:
df[df['reparticion'] == 'SECR Justicia y Seguridad']['total_salario_bruto_i_+_ii'].sum()

Ahora respondamos algunas preguntas: ¿Quién o quiénes del dataset cobran el salario más alto? ¿Y el más bajo?

In [ ]:
df[df['total_salario_bruto_i_+_ii'] == df['total_salario_bruto_i_+_ii'].max()]

In [ ]:
df[df['total_salario_bruto_i_+_ii'] == df['total_salario_bruto_i_+_ii'].min()]

# Otros análisis descriptivos

Pandas viene con algunas funciones built-in para ayudar al análisis descriptivo.

## Para las variables numéricas

In [82]:
df.describe()

         anio         mes  ...   aguinaldo_ii  total_salario_bruto_i_+_ii
count   385.0  385.000000  ...     385.000000                  385.000000
mean   2019.0    6.631169  ...   20282.084883               254516.452883
std       0.0    3.539077  ...   45248.840725                51434.987870
min    2019.0    1.000000  ...       0.000000               185396.540000
25%    2019.0    4.000000  ...       0.000000               224516.620000
50%    2019.0    7.000000  ...       0.000000               245811.620000
75%    2019.0   10.000000  ...       0.000000               263531.980000
max    2019.0   12.000000  ...  170855.560000               445945.310000

[8 rows x 5 columns]

## Para las variables categóricas

In [83]:
df['reparticion'].value_counts()

SECR Justicia y Seguridad                                         13
SECR de Medios                                                    13
Ministerio de Salud                                               13
SECR Desarrollo Ciudadano                                         13
Ministerio de Cultura                                             12
Jefe de Gobierno                                                  12
Ministerio de Desarrollo Urbano y Transporte                      12
SS Comunicacion                                                   12
Ente de Turismo Ley Nº 2627                                       12
SECR Planificación, Evaluación y Coordinación de Gestión          12
Jefatura de Gabinete de Ministros                                 12
SS Contenidos                                                     12
Ministerio de Gobierno                                            12
SECR Integración Social Para Personas Mayores                     12
Procuración General de la Ciudad de Buenos Aires                  12
SECR Integración Social y Urbana                                  12
UPE Transferencia de Funciones y Facultades en Materia de Seg.    12
Sindicatura General de la Ciudad de Buenos Aires                  12
SECR Administración de Seguridad y Emergencias                    12
SECR Legal y Técnica                                              12
Consejo de los Derechos de Niñas, Niños y Adoles - Presidencia    12
Vicejefatura de Gobierno                                          12
SECR Cultura Ciudadana y Función Pública                          11
Ministerio de Economía y Finanzas                                 11
Ministerio de Hábitat y Desarrollo Humano                         11
SECR Transporte                                                   11
SECR Atención y Gestión Ciudadana                                 11
SECR General y de Relaciones Internacionales                      11
Ministerio de Educación e Innovación                              11
SECR Coordinación General                                         11
Ministerio de Ambiente y Espacio Público                          11
Ministerio de Desarrollo Humano y Hábitat                          2
Ministerio de Espacio Público e Higiene Urbana                     2
SECR Ciencia, Tecnologia e Innovacion                              2
SECR Comunicación, Contenidos y Participación Ciudadana            1
SECR Transporte y Obras Públicas                                   1
Ministerio de Educación                                            1
Ministerio de Hacienda y Finanzas                                  1
Ministerio de Desarrollo Económico y Producción                    1
SECR General y Relaciones Internacionales                          1
SECR Ambiente                                                      1
SECR Desarrollo Urbano                                             1
SECR Innovación y Transformación Digital                           1
SECR Atención Ciudadana y Gestión Comunal                          1
SECR Transformación Cultural                                       1
SECR Asuntos Estratégicos                                          1
Name: reparticion, dtype: int64

### Ejercicio: Volviendo al ejemplo del Titanic.

1) ¿Cuál era la edad promedio de los pasajeros de cada clase (Pclass)?

2) ¿Cuál fue la tarifa que pagaron en promedio los hombres? ¿Y las mujeres?

3) ¿Cuánto pagaron en total los pasajeros de primera clase para subir al Titanic? ¿Y los de tercera?

4) ¿Cuántos pasajeros había en cada tipo de clase?

In [85]:
df_titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [99]:
df_titanic[df_titanic['Pclass']==1]['Age'].mean()

38.233440860215055

In [100]:
df_titanic[df_titanic['Pclass']==2]['Age'].mean()

29.87763005780347

In [101]:
df_titanic[df_titanic['Pclass']==3]['Age'].mean()

25.14061971830986

In [104]:
df_titanic[df_titanic['Sex']=='male']['Fare'].mean()

25.523893414211418

In [105]:
df_titanic[df_titanic['Sex']=='female']['Fare'].mean()

44.47981783439487

In [106]:
df_titanic[df_titanic['Pclass']==1]['Fare'].sum()

18177.4125

In [107]:
df_titanic[df_titanic['Pclass']==2]['Fare'].sum()

3801.8417

In [108]:
df_titanic[df_titanic['Pclass']==3]['Fare'].sum()

6714.6951

In [109]:
df_titanic['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

## Ordenar por columnas y limitar la cantidad de resultados

Otra forma de resolver el problema de encontrar el mayor y el menos es con el método sort_values. Este método puede recibir un valor único (nombre de columna) o una lista (con varias columnas) y un orden asc o desc. Por default el orden es asc.

Si combinamos el ordenamiento con el método head() para limitar la cantidad de resultados, podemos encontrar los N primeros.

In [ ]:
# Recordemos cómo abrir la documentación de un método
df.sort_values?

In [84]:
# Calculamos el máximo
df.sort_values('total_salario_bruto_i_+_ii',ascending=False).head(1)

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
374  20-13872301-2  2019  ...                   445945.31           NaN

[1 rows x 10 columns]

In [110]:
# Calculamos el mínimo
df.sort_values('total_salario_bruto_i_+_ii',ascending=True).head(1)

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
344  27-30744939-6  2019  ...                   185396.54  baja al 9/12

[1 rows x 10 columns]

# Anexo: volviendo al tema de la vectorización

¿Por qué es tan importante trabajar con Pandas y no con funciones escritas por nosotros en Python nativo y que procesen los datos dentro de un for loop?

Por un lado está la comodidad. Hay mucha funcionalidad que ya está desarrollada en Pandas. Existen funciones que resuelven muchos de los problemas clásicos de manipular datos: agrupar, sumarizar, sacar estadísticas, filtrar, etc. Pero además hay una razón de performance. 

Veamos una demostración de que vectorizar es más eficiente. Vamos a crear dos listas de 1.000.000 de números aleatorios cada una y vamos a tratar de multiplicar elemento por elemento con pandas y sin pandas:

In [111]:
lista1 = list(np.random.randint(1, 100, 1000000))
lista2 = list(np.random.randint(1, 100, 1000000))

In [112]:
%%timeit 
for x,y in zip(lista1,lista2):
    x * y

10 loops, best of 3: 161 ms per loop

Ahora probemos hacer lo mismo con dos series de Pandas

In [113]:
serie1 = pd.Series(lista1)
serie2 = pd.Series(lista2)

In [114]:
%%timeit 
resultado = serie1 * serie2

1000 loops, best of 3: 1.79 ms per loop

Conclusión: la operación vectorizada es <strong> más de 70 veces más rápida.</strong>